flies/ims/ADDATS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ats="http://www.huawei.com/ATS" xmlns:xcap="http://uri.etsi.org/ngn/params/xml/simservs/xcap" xmlns:urn="urn:ietf:params:xml:ns:common-policy" xmlns:ext="http://www.huawei.com/IMS/ATS9900/extension">
   <soapenv:Header>
      <ats:MessageID>1</ats:MessageID>
      <ats:MEName></ats:MEName>
      <ats:Authentication>
         <ats:Username>sltprovision</ats:Username>
         <ats:Password>SoftX3000@</ats:Password>
      </ats:Authentication>
   </soapenv:Header>
   <soapenv:Body>
      <ats:ADD_MSR>
         <ats:IMPU>sip:+IMS_USERID@sltims.lk</ats:IMPU>
         <ats:SERVICEDATA>
         <xcap:MMTelServices>
         </xcap:MMTelServices>
            <xcap:im-csi-information>
            </xcap:im-csi-information>
            <xcap:MMTel-extension>
               <xcap:basic-part>
                  <xcap:call-source-code>SOURCE</xcap:call-source-code>
                  <xcap:user-name></xcap:user-name>
                  <xcap:call-out-authority>
                     <xcap:local>true</xcap:local>
                     <xcap:local-toll>true</xcap:local-toll>
                     <xcap:national-toll>true</xcap:national-toll>
                     <xcap:international-toll>true</xcap:international-toll>
                     <xcap:intra-local-toll>true</xcap:intra-local-toll>
                     <xcap:intra-national-toll>true</xcap:intra-national-toll>
					 <xcap:customized-call-out-authority1>false</xcap:customized-call-out-authority1>
                     <xcap:customized-call-out-authority2>false</xcap:customized-call-out-authority2>
                     <xcap:customized-call-out-authority3>false</xcap:customized-call-out-authority3>
                     <xcap:customized-call-out-authority4>false</xcap:customized-call-out-authority4>
                     <xcap:customized-call-out-authority5>false</xcap:customized-call-out-authority5>
                     <xcap:customized-call-out-authority6>false</xcap:customized-call-out-authority6>
                     <xcap:customized-call-out-authority7>false</xcap:customized-call-out-authority7>
                     <xcap:customized-call-out-authority8>false</xcap:customized-call-out-authority8>
                     <xcap:customized-call-out-authority9>false</xcap:customized-call-out-authority9>
                     <xcap:customized-call-out-authority10>false</xcap:customized-call-out-authority10>
                     <xcap:customized-call-out-authority11>false</xcap:customized-call-out-authority11>
                     <xcap:customized-call-out-authority12>false</xcap:customized-call-out-authority12>
                     <xcap:customized-call-out-authority13>false</xcap:customized-call-out-authority13>
                     <xcap:customized-call-out-authority14>false</xcap:customized-call-out-authority14>
                     <xcap:customized-call-out-authority15>false</xcap:customized-call-out-authority15>
                     <xcap:customized-call-out-authority16>false</xcap:customized-call-out-authority16>
                     <xcap:customized-call-out-authority17>false</xcap:customized-call-out-authority17>
                     <xcap:customized-call-out-authority18>false</xcap:customized-call-out-authority18>
                     <xcap:customized-call-out-authority19>false</xcap:customized-call-out-authority19>
                     <xcap:customized-call-out-authority20>false</xcap:customized-call-out-authority20>
                     <xcap:customized-call-out-authority21>false</xcap:customized-call-out-authority21>
                     <xcap:customized-call-out-authority22>false</xcap:customized-call-out-authority22>
                     <xcap:customized-call-out-authority23>false</xcap:customized-call-out-authority23>
                     <xcap:customized-call-out-authority24>false</xcap:customized-call-out-authority24>
                     <xcap:customized-call-out-authority25>false</xcap:customized-call-out-authority25>
                     <xcap:customized-call-out-authority26>false</xcap:customized-call-out-authority26>
                     <xcap:customized-call-out-authority27>false</xcap:customized-call-out-authority27>
                     <xcap:customized-call-out-authority28>false</xcap:customized-call-out-authority28>
                     <xcap:customized-call-out-authority29>false</xcap:customized-call-out-authority29>
                     <xcap:customized-call-out-authority30>false</xcap:customized-call-out-authority30>
                     <xcap:customized-call-out-authority31>false</xcap:customized-call-out-authority31>
                     <xcap:customized-call-out-authority32>false</xcap:customized-call-out-authority32>
                     <xcap:customized-high-entertainment-call-out>false</xcap:customized-high-entertainment-call-out>
                     <xcap:customized-opertator>false</xcap:customized-opertator>
                  </xcap:call-out-authority>
                  <xcap:user-category></xcap:user-category>
                  <xcap:user-password>0000</xcap:user-password>
                  <xcap:charge-source-code>0</xcap:charge-source-code>
                  <xcap:limit-group>65534</xcap:limit-group>
                  <xcap:limitation-of-parallel-calls>1</xcap:limitation-of-parallel-calls>
                  <xcap:implicit-ua-profile-subscribe>true</xcap:implicit-ua-profile-subscribe>
                  <xcap:black-white-number-name></xcap:black-white-number-name>
                  <xcap:enhanced-category></xcap:enhanced-category>
                  <xcap:first-level-bill-group>65535</xcap:first-level-bill-group>
				  <xcap:limitation-of-parallel-holds>2</xcap:limitation-of-parallel-holds>
                  <xcap:reserved-field/>                  
               </xcap:basic-part>
            </xcap:MMTel-extension>
            <xcap:OdbForImsOrientedServices>
            </xcap:OdbForImsOrientedServices>
         </ats:SERVICEDATA>
         <ats:TEMPLATENAME></ats:TEMPLATENAME>
      </ats:ADD_MSR>
   </soapenv:Body>
</soapenv:Envelope>
